app/views/authors/show.html.erb

<p>Posts:</p>
<% @author.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 1]]